-- Без прочих
-- С перерасчетами текущего года

DECLARE @DateBegin DATE = '20210401',
        @DateEnd   DATE = '20210401',
        @D   INT  = 1000;

WITH Volumes AS (
    SELECT
        Счет,
        [Месяц расчета],
        [Месяц расчета] AS [Месяц долга],
        [Номер услуги], 
        Аналитика1,
        Поставщик, 
        Объем
    FROM [stack].[НТариф]
    WHERE [Месяц расчета] BETWEEN @DateBegin AND @DateEnd
      AND [Номер услуги] - [Номер услуги] % 100 IN (100, 200, 400)

        UNION ALL

    SELECT
        Счет,
        [Месяц расчета],
        [Перерасчет] AS [Месяц долга],
        [Номер услуги], 
        Аналитика1,
        Поставщик, 
        Объем
    FROM [stack].[НПТариф]
    WHERE [Месяц расчета] BETWEEN @DateBegin AND @DateEnd
      AND [Номер услуги] - [Номер услуги] % 100 IN (100, 200, 400)
      AND Перерасчет BETWEEN DATEFROMPARTS(DATEPART(YEAR, @DateBegin), 1, 1) AND DATEFROMPARTS(DATEPART(YEAR, @DateBegin), 12, 1) -- Перерасчеты текущих лет
), VolumesAll AS (
    SELECT
        ST.Лицевой,
        ST.Родитель,
        V.Поставщик,
        CONCAT(A.Тариф, A.Тарифность, A.Зона, ST.Тип) AS Группа,
        Объем
    FROM Volumes AS V
    JOIN [dbo].[ServiceTable_LS_ArtemovAS] AS ST ON ST.Лицевой = V.Счет AND V.[Месяц долга] = ST.Месяц
    LEFT JOIN [dbo].[AnaliticReplace_LS_ArtemovAS] AS AR ON V.[Номер услуги] = AR.Услуга 
    LEFT JOIN [dbo].[Analitic_LS_ArtemovAS] AS A ON IIF(AR.Услуга IS NULL, V.[Номер услуги], IIF(V.Аналитика1 > 0, V.Аналитика1, ST.Услуга)) = A.Услуга
), Detail AS (
    SELECT
        Родитель,
        Лицевой,
        Поставщик,
        -- Газовые плиты     мкд                             чд                             прочие
        ISNULL([Г110], 0) AS [Г110],    ISNULL([Г111], 0) AS [Г111],   ISNULL([Г112], 0) AS [Г112],
        ISNULL([Г210], 0) AS [Г210],    ISNULL([Г211], 0) AS [Г211],   ISNULL([Г212], 0) AS [Г212], 
        ISNULL([Г220], 0) AS [Г220],    ISNULL([Г221], 0) AS [Г221],   ISNULL([Г222], 0) AS [Г222],
        ISNULL([Г310], 0) AS [Г310],    ISNULL([Г311], 0) AS [Г311],   ISNULL([Г312], 0) AS [Г312], 
        ISNULL([Г320], 0) AS [Г320],    ISNULL([Г321], 0) AS [Г321],   ISNULL([Г322], 0) AS [Г322], 
        ISNULL([Г330], 0) AS [Г330],    ISNULL([Г331], 0) AS [Г331],   ISNULL([Г332], 0) AS [Г332],
        
        -- Электроплиты      мкд                             чд                             прочие
        ISNULL([Э110], 0) AS [Э110],    ISNULL([Э111], 0) AS [Э111],   ISNULL([Э112], 0) AS [Э112],
        ISNULL([Э210], 0) AS [Э210],    ISNULL([Э211], 0) AS [Э211],   ISNULL([Э212], 0) AS [Э212], 
        ISNULL([Э220], 0) AS [Э220],    ISNULL([Э221], 0) AS [Э221],   ISNULL([Э222], 0) AS [Э222],
        ISNULL([Э310], 0) AS [Э310],    ISNULL([Э311], 0) AS [Э311],   ISNULL([Э312], 0) AS [Э312], 
        ISNULL([Э320], 0) AS [Э320],    ISNULL([Э321], 0) AS [Э321],   ISNULL([Э322], 0) AS [Э322], 
        ISNULL([Э330], 0) AS [Э330],    ISNULL([Э331], 0) AS [Э331],   ISNULL([Э332], 0) AS [Э332],

        -- Село              мкд                             чд                             прочие
        ISNULL([С110], 0) AS [С110],    ISNULL([С111], 0) AS [С111],   ISNULL([С112], 0) AS [С112],
        ISNULL([С210], 0) AS [С210],    ISNULL([С211], 0) AS [С211],   ISNULL([С212], 0) AS [С212], 
        ISNULL([С220], 0) AS [С220],    ISNULL([С221], 0) AS [С221],   ISNULL([С222], 0) AS [С222],
        ISNULL([С310], 0) AS [С310],    ISNULL([С311], 0) AS [С311],   ISNULL([С312], 0) AS [С312], 
        ISNULL([С320], 0) AS [С320],    ISNULL([С321], 0) AS [С321],   ISNULL([С322], 0) AS [С322], 
        ISNULL([С330], 0) AS [С330],    ISNULL([С331], 0) AS [С331],   ISNULL([С332], 0) AS [С332]
    FROM VolumesAll
    PIVOT(
       SUM(Объем) FOR Группа IN (
            [Г110], [Г111], [Г112],                                                 -- Газовые плиты - однотарифный: День { мкд, чд, прочие }
            [Г210], [Г211], [Г212], [Г220], [Г221], [Г222],                         -- Газовые плиты - двухтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие }
            [Г310], [Г311], [Г312], [Г320], [Г321], [Г322], [Г330], [Г331], [Г332], -- Газовые плиты - трехтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие } ППик { мкд, чд, прочие }
            [С110], [С111], [С112],                                                 -- Село          - однотарифный: День { мкд, чд, прочие }
            [С210], [С211], [С212], [С220], [С221], [С222],                         -- Село          - двухтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие }
            [С310], [С311], [С312], [С320], [С321], [С322], [С330], [С331], [С332], -- Село          - трехтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие } ППик { мкд, чд, прочие }
            [Э110], [Э111], [Э112],                                                 -- Электроплиты  - трехтарифный: День { мкд, чд, прочие }
            [Э210], [Э211], [Э212], [Э220], [Э221], [Э222],                         -- Электроплиты  - трехтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие }
            [Э310], [Э311], [Э312], [Э320], [Э321], [Э322], [Э330], [Э331], [Э332]  -- Электроплиты  - трехтарифный: День { мкд, чд, прочие } Ночь { мкд, чд, прочие } ППик { мкд, чд, прочие }
       )
    ) AS PVT
), Rearranged AS (
    SELECT
        Родитель,
        Лицевой,
        Поставщик,
        -- Газовые плиты 
        [Г110]                   AS [Г110], -- Однотарифный мкд
        [Г111]                   AS [Г111], -- Однотарифный чд
        [Г210] + [Г310] + [Г330] AS [Г210], -- Двухтарифный день мкд + Трехтарифный день мкд + Трехтарифный полупик мкд
        [Г211] + [Г311] + [Г331] AS [Г211], -- Двухтарифный день чд  + Трехтарифный день чд  + Трехтарифный полупик чд
        [Г220] + [Г320]          AS [Г220], -- Двухтарифный ночь мкд + Трехтарифный ночь мкд
        [Г221] + [Г321]          AS [Г221], -- Двухтарифный ночь чд  + Трехтарифный ночь чд

        -- Электроплиты
        [Э110]                   AS [Э110], 
        [Э111]                   AS [Э111],
        [Э210] + [Э310] + [Э330] AS [Э210], 
        [Э211] + [Э311] + [Э331] AS [Э211], 
        [Э220] + [Э320]          AS [Э220], 
        [Э221] + [Э321]          AS [Э221],

        -- Село
        [С110]                   AS [С110], 
        [С111]                   AS [С111],
        [С210] + [С310] + [С330] AS [С210], 
        [С211] + [С311] + [С331] AS [С211], 
        [С220] + [С320]          AS [С220], 
        [С221] + [С321]          AS [С221]
    FROM Detail
), МО AS (
    -- Выгрузка по МО
    SELECT 
        S.Район,
        S.Образование, 

        -- Всего
        SUM([Г110])/@d + SUM([Г111])/@d + SUM([Г210])/@d + SUM([Г211])/@d + SUM([Г220])/@d + SUM([Г221])/@d +
        SUM([Э110])/@d + SUM([Э111])/@d + SUM([Э210])/@d + SUM([Э211])/@d + SUM([Э220])/@d + SUM([Э221])/@d +
        SUM([С110])/@d + SUM([С111])/@d + SUM([С210])/@d + SUM([С211])/@d + SUM([С220])/@d + SUM([С221])/@d AS Всего,

        -- Газовые плиты 
        SUM([Г110])/@d               AS [Г110],     -- Однотарифный мкд
        SUM([Г111])/@d               AS [Г111],     -- Однотарифный чд
        SUM([Г110])/@d + SUM([Г111])/@d AS [Г11_Итог], -- Однотарифный всего
        SUM([Г210])/@d               AS [Г210],     -- Двухтарифный день мкд + Трехтарифный день мкд + Трехтарифный полупик мкд
        SUM([Г211])/@d               AS [Г211],     -- Двухтарифный день чд  + Трехтарифный день чд  + Трехтарифный полупик чд
        SUM([Г210])/@d + SUM([Г211])/@d AS [Г21_Итог], -- Двухтарифный день всего 
        SUM([Г220])/@d               AS [Г220],     -- Двухтарифный ночь мкд + Трехтарифный ночь мкд
        SUM([Г221])/@d               AS [Г221],     -- Двухтарифный ночь чд  + Трехтарифный ночь чд
        SUM([Г220])/@d + SUM([Г221])/@d AS [Г22_Итог], -- Двухтарифный ночь всего

        -- Электроплиты
        SUM([Э110])/@d               AS [Э110],
        SUM([Э111])/@d               AS [Э111],
        SUM([Э110])/@d + SUM([Э111])/@d AS [Э11_Итог],
        SUM([Э210])/@d               AS [Э210],
        SUM([Э211])/@d               AS [Э211],
        SUM([Э210])/@d + SUM([Э211])/@d AS [Э21_Итог],    
        SUM([Э220])/@d               AS [Э220],
        SUM([Э221])/@d               AS [Э221],
        SUM([Э220])/@d + SUM([Э221])/@d AS [Э22_Итог],

        -- Село
        SUM([С110])/@d               AS [С110],
        SUM([С111])/@d               AS [С111],
        SUM([С110])/@d + SUM([С111])/@d AS [С11_Итог],
        SUM([С210])/@d               AS [С210],
        SUM([С211])/@d               AS [С211],
        SUM([С210])/@d + SUM([С211])/@d AS [С21_Итог],    
        SUM([С220])/@d               AS [С220],
        SUM([С221])/@d               AS [С221],
        SUM([С220])/@d + SUM([С221])/@d AS [С22_Итог]
    FROM Rearranged AS D
    JOIN [dbo].[temp_Settlements_ArtemovAS] AS S ON D.Родитель = S.id_счет
    WHERE S.Субъект = 'КК'
    GROUP BY S.Район, S.Образование
), Поставщики AS (
    -- Выгрузка по поставщикам
    SELECT 
        O.Название AS Поставщик,

        -- Всего
        SUM([Г110])/@d + SUM([Г111])/@d + SUM([Г210])/@d + SUM([Г211])/@d + SUM([Г220])/@d + SUM([Г221])/@d +
        SUM([Э110])/@d + SUM([Э111])/@d + SUM([Э210])/@d + SUM([Э211])/@d + SUM([Э220])/@d + SUM([Э221])/@d +
        SUM([С110])/@d + SUM([С111])/@d + SUM([С210])/@d + SUM([С211])/@d + SUM([С220])/@d + SUM([С221])/@d AS Всего,

        -- Газовые плиты 
        SUM([Г110])/@d               AS [Г110],     -- Однотарифный мкд
        SUM([Г111])/@d               AS [Г111],     -- Однотарифный чд
        SUM([Г110])/@d + SUM([Г111])/@d AS [Г11_Итог], -- Однотарифный всего
        SUM([Г210])/@d               AS [Г210],     -- Двухтарифный день мкд + Трехтарифный день мкд + Трехтарифный полупик мкд
        SUM([Г211])/@d               AS [Г211],     -- Двухтарифный день чд  + Трехтарифный день чд  + Трехтарифный полупик чд
        SUM([Г210])/@d + SUM([Г211])/@d AS [Г21_Итог], -- Двухтарифный день всего 
        SUM([Г220])/@d               AS [Г220],     -- Двухтарифный ночь мкд + Трехтарифный ночь мкд
        SUM([Г221])/@d               AS [Г221],     -- Двухтарифный ночь чд  + Трехтарифный ночь чд
        SUM([Г220])/@d + SUM([Г221])/@d AS [Г22_Итог], -- Двухтарифный ночь всего

        -- Электроплиты
        SUM([Э110])/@d               AS [Э110],
        SUM([Э111])/@d               AS [Э111],
        SUM([Э110])/@d + SUM([Э111])/@d AS [Э11_Итог],
        SUM([Э210])/@d               AS [Э210],
        SUM([Э211])/@d               AS [Э211],
        SUM([Э210])/@d + SUM([Э211])/@d AS [Э21_Итог],    
        SUM([Э220])/@d               AS [Э220],
        SUM([Э221])/@d               AS [Э221],
        SUM([Э220])/@d + SUM([Э221])/@d AS [Э22_Итог],

        -- Село
        SUM([С110])/@d               AS [С110],
        SUM([С111])/@d               AS [С111],
        SUM([С110])/@d + SUM([С111])/@d AS [С11_Итог],
        SUM([С210])/@d               AS [С210],
        SUM([С211])/@d               AS [С211],
        SUM([С210])/@d + SUM([С211])/@d AS [С21_Итог],    
        SUM([С220])/@d               AS [С220],
        SUM([С221])/@d               AS [С221],
        SUM([С220])/@d + SUM([С221])/@d AS [С22_Итог]
    FROM Rearranged AS D
    JOIN [dbo].[temp_Settlements_ArtemovAS] AS S ON D.Родитель = S.id_счет
    LEFT JOIN [stack].[Организации] AS O ON D.Поставщик = O.row_id
    WHERE S.Субъект = 'КК'
    GROUP BY O.Название
)
SELECT * 
FROM МО
ORDER BY Район, Образование


--SELECT * 
--FROM Поставщики
--ORDER BY Поставщик